<!-- dflook/terraform-github-actions {"workspace":"dflook-patch-1-2","backend_type":"remote","backend":"6ffb879f54ef9841bbc17c6a0890c9f61ec073dabb01ce27272b587d2500adfd","plan_job_ref":"Job Test Terraform cloud #359 at https://github.com/dflook/terraform-github-actions/actions/runs/17349369241","plan_hash":"fff442a065b65c82da38a581bdfda3431d199d991d63a1ac1cf9024bf26a86c6","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __dflook-patch-1-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Test Terraform cloud #359](https://github.com/dflook/terraform-github-actions/actions/runs/17349369241)
<details open><summary>Outputs</summary>

```hcl
default        = "default"
from_tfvars    = "from_tfvars"
from_variables = "from_variables"
```
</details>